## Basic Panda Example to read out from an excel file

In [2]:
import pandas as pd

In [3]:
df=pd.read_excel('students.xlsx')

In [4]:
print('Printing Data Frame as follows')
df

Printing Data Frame as follows

    Name  Age  Marks
0   John   20     85
1  Alice   22     90
2    Bob   21     78
3   Sara   23     92

In [5]:
dfpatients=pd.read_csv("C:/Users/User/Desktop/AIML-TRAINING/Day-10/patients.csv")

In [6]:
dfpatients

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
0,PAT-09484753,Richard Rodriguez,24,16/3/2025,22/3/2025,surgery,61
1,PAT-f0644084,Shannon Walker,6,13/12/2025,14/12/2025,surgery,83
2,PAT-ac6162e4,Julia Torres,24,29/6/2025,5/7/2025,general_medicine,83
3,PAT-3dda2bb5,Crystal Johnson,32,12/10/2025,23/10/2025,emergency,81
4,PAT-08591375,Garrett Lin,25,18/2/2025,25/2/2025,ICU,76
...,...,...,...,...,...,...,...
995,PAT-a01bf534,Amber Vang,26,2/12/2025,4/12/2025,emergency,91
996,PAT-87fa07bd,Martha Smith,89,18/11/2025,30/11/2025,emergency,99
997,PAT-8f07e894,Jennifer James,72,12/12/2025,21/12/2025,ICU,69
998,PAT-4ae301e1,Kara Hernandez,47,8/2/2025,20/2/2025,ICU,61
999,PAT-e2ef9c5f,Lorraine Turner,64,4/5/2025,8/5/2025,general_medicine,83

In [7]:
dfpatients['name']

0      Richard Rodriguez
1         Shannon Walker
2           Julia Torres
3        Crystal Johnson
4            Garrett Lin
             ...
995           Amber Vang
996         Martha Smith
997       Jennifer James
998       Kara Hernandez
999      Lorraine Turner
Name: name, Length: 1000, dtype: object

In [8]:
print(dfpatients['name'])

0      Richard Rodriguez
1         Shannon Walker
2           Julia Torres
3        Crystal Johnson
4            Garrett Lin
             ...
995           Amber Vang
996         Martha Smith
997       Jennifer James
998       Kara Hernandez
999      Lorraine Turner
Name: name, Length: 1000, dtype: object

## Head in dataframe

In [9]:
df.head()

    Name  Age  Marks
0   John   20     85
1  Alice   22     90
2    Bob   21     78
3   Sara   23     92

In [10]:
dfpatients.head()

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
0,PAT-09484753,Richard Rodriguez,24,16/3/2025,22/3/2025,surgery,61
1,PAT-f0644084,Shannon Walker,6,13/12/2025,14/12/2025,surgery,83
2,PAT-ac6162e4,Julia Torres,24,29/6/2025,5/7/2025,general_medicine,83
3,PAT-3dda2bb5,Crystal Johnson,32,12/10/2025,23/10/2025,emergency,81
4,PAT-08591375,Garrett Lin,25,18/2/2025,25/2/2025,ICU,76

In [11]:
dfpatients.head(2)

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
0,PAT-09484753,Richard Rodriguez,24,16/3/2025,22/3/2025,surgery,61
1,PAT-f0644084,Shannon Walker,6,13/12/2025,14/12/2025,surgery,83

# Tail example

In [12]:
print('last two students in Excel sheet')
df.tail(2)

last two students in Excel sheet

   Name  Age  Marks
2   Bob   21     78
3  Sara   23     92

In [13]:
dfpatients.tail(5)

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
995,PAT-a01bf534,Amber Vang,26,2/12/2025,4/12/2025,emergency,91
996,PAT-87fa07bd,Martha Smith,89,18/11/2025,30/11/2025,emergency,99
997,PAT-8f07e894,Jennifer James,72,12/12/2025,21/12/2025,ICU,69
998,PAT-4ae301e1,Kara Hernandez,47,8/2/2025,20/2/2025,ICU,61
999,PAT-e2ef9c5f,Lorraine Turner,64,4/5/2025,8/5/2025,general_medicine,83

## Shape example shape returns you (rows,columns)

In [15]:
dfpatients.shape

(1000, 7)

In [16]:
df.shape

(4, 3)

In [17]:
df.shape

(4, 3)

In [20]:
    r,c=dfpatients.shape
    print(f"rows: {rows} columns: {cols}")

rows: 1000 columns: 7

In [21]:
r,c=dfpatients.shape
print('rows and columns in students sheet')
print(f"rows: {rows} columns: {cols}")

rows and columns in students sheet
rows: 1000 columns: 7

# Values: in dataframe

In [22]:
print('student values')
df.values

student values

array([['John', 20, 85],
       ['Alice', 22, 90],
       ['Bob', 21, 78],
       ['Sara', 23, 92]], dtype=object)

In [27]:
print('patients values')
dfpatients.values

patients values

array([['PAT-09484753', 'Richard Rodriguez', 24, ..., '22/3/2025',
        'surgery', 61],
       ['PAT-f0644084', 'Shannon Walker', 6, ..., '14/12/2025',
        'surgery', 83],
       ['PAT-ac6162e4', 'Julia Torres', 24, ..., '5/7/2025',
        'general_medicine', 83],
       ...,
       ['PAT-8f07e894', 'Jennifer James', 72, ..., '21/12/2025', 'ICU',
        69],
       ['PAT-4ae301e1', 'Kara Hernandez', 47, ..., '20/2/2025', 'ICU',
        61],
       ['PAT-e2ef9c5f', 'Lorraine Turner', 64, ..., '8/5/2025',
        'general_medicine', 83]], dtype=object)